169/src/Documents/ПриходДенег/ПриходДенег.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходДенег</name>
  <registerRecords>AccountingRegister.Управленческий</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокКонтрагентов</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВал</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

169/src/AccountingRegisters/Управленческий/Управленческий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Управленческий</name>
  <chartOfAccounts>ChartOfAccounts.Управленческий</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <resources>
    <name>СуммаВал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Управленческий.AccountingFlag.Валютный</accountingFlag>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Управленческий.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Управленческий.AccountingFlag.Количественный</accountingFlag>
  </resources>
</mdclass:AccountingRegister>

169/src/ChartsOfAccounts/Управленческий/Управленческий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>Управленческий</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконто</extDimensionTypes>
  <predefined>
    <items>
      <name>Активы</name>
      <description>Активы</description>
      <code>01</code>
      <childItems>
        <name>Касса</name>
        <description>Касса</description>
        <code>01.01</code>
      </childItems>
      <childItems>
        <name>Товары</name>
        <description>Товары</description>
        <code>01.02</code>
      </childItems>
      <childItems>
        <name>ТоварыВПути</name>
        <description>Товары в пути</description>
        <code>01.03</code>
      </childItems>
      <childItems>
        <name>Покупатели</name>
        <description>Покупатели</description>
        <code>01.04</code>
        <accountType>ActivePassive</accountType>
      </childItems>
      <childItems>
        <name>ОсновноеПроизводство</name>
        <description>Основное производство</description>
        <code>01.05</code>
      </childItems>
      <childItems>
        <name>ОбщехозяйственныеЗатраты</name>
        <description>Общехозяйственные затраты</description>
        <code>01.06</code>
      </childItems>
      <childItems>
        <name>КредитыИЗаймыВыданные</name>
        <description>Кредиты и займы выданные</description>
        <code>01.07</code>
      </childItems>
      <childItems>
        <name>Материалы</name>
        <description>Материалы</description>
        <code>01.08</code>
      </childItems>
    </items>
    <items>
      <name>Обязательства</name>
      <description>Обязательства</description>
      <code>02</code>
      <accountType>Passive</accountType>
      <childItems>
        <name>Сотрудники</name>
        <description>Сотрудники</description>
        <code>02.01</code>
        <accountType>ActivePassive</accountType>
      </childItems>
      <childItems>
        <name>Поставщики</name>
        <description>Поставщики</description>
        <code>02.02</code>
        <accountType>ActivePassive</accountType>
      </childItems>
      <childItems>
        <name>КредитыИЗаймыПолученные</name>
        <description>Кредиты и займы полученные</description>
        <code>02.03</code>
        <accountType>Passive</accountType>
      </childItems>
      <childItems>
        <name>Налоги</name>
        <description>Налоги</description>
        <code>02.04</code>
        <accountType>Passive</accountType>
      </childItems>
      <childItems>
        <name>Агенты</name>
        <description>Агенты</description>
        <code>02.05</code>
        <accountType>Passive</accountType>
      </childItems>
    </items>
    <items>
      <name>ПрибылиУбытки</name>
      <description>Прибыли убытки</description>
      <code>03</code>
      <accountType>ActivePassive</accountType>
    </items>
  </predefined>
  <accountingFlags>
    <name>Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <accountingFlags>
    <name>Валютный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <extDimensionAccountingFlags>
    <name>Суммовой</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
</mdclass:ChartOfAccounts>

169/src/Documents/ПриходДенег/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр Управленческий 
	Движения.Управленческий.Записывать = Истина;

	  МенеджерВТ = Новый МенеджерВременныхТаблиц;
	  Запрос = Новый Запрос;
	  Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	  Запрос.Текст = "ВЫБРАТЬ
	                 |	ПриходДенегСписокКонтрагентов.Контрагент КАК Контрагент,
	                 |	СУММА(ПриходДенегСписокКонтрагентов.Сумма) КАК Сумма,
	                 |	СУММА(ПриходДенегСписокКонтрагентов.СуммаВал) КАК СуммаВал
	                 |ПОМЕСТИТЬ ТЧ
	                 |ИЗ
	                 |	Документ.ПриходДенег.СписокКонтрагентов КАК ПриходДенегСписокКонтрагентов
	                 |ГДЕ
	                 |	ПриходДенегСписокКонтрагентов.Ссылка = &Ссылка
	                 |
	                 |СГРУППИРОВАТЬ ПО
	                 |	ПриходДенегСписокКонтрагентов.Контрагент
	                 |
	                 |ИНДЕКСИРОВАТЬ ПО
	                 |	Контрагент
	                 |;
	                 |
	                 |////////////////////////////////////////////////////////////////////////////////
	                 |ВЫБРАТЬ
	                 |	ТЧ.Контрагент КАК Контрагент,
	                 |	ТЧ.Сумма КАК Сумма,
	                 |	ТЧ.СуммаВал КАК СуммаВал
	                 |ИЗ
	                 |	ТЧ КАК ТЧ"; 
	  Запрос.УстановитьПараметр("Ссылка",Ссылка);
	  Выборка = Запрос.Выполнить().Выбрать();
	  
	  Пока Выборка.Следующий() Цикл  
		//Дт «Касса» - Кт «Покупатели» на сумму оплат 
		
		Движение = Движения.Управленческий.Добавить();
		Движение.Организация = Организация;
		Движение.СчетДт = ПланыСчетов.Управленческий.Касса;
		Движение.СчетКт = ПланыСчетов.Управленческий.Покупатели;
		Движение.Период = Дата;
		Движение.ВалютаКт = Валюта;
		Движение.Сумма = Выборка.Сумма;
		Движение.СуммаВалКт = Выборка.СуммаВал;
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты] = Выборка.Контрагент;
		
	КонецЦикла;	
	
	//Движения.Управленческий.БлокироватьДляИзменения = Истина;
	Движения.Записать();
	
	Отказ = КонтрольКорректностиОплатвПоСуммеЗадолженности(МенеджерВТ);
	
КонецПроцедуры

Функция КонтрольКорректностиОплатвПоСуммеЗадолженности(МенеджерВТ)
	
	ОтменитьПроведение = Ложь;
	
	Запрос2 = Новый Запрос;
	Запрос2.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос2.Текст = "ВЫБРАТЬ
	                |	УправленческийОстатки.Субконто1 КАК Контрагент,
	                |	УправленческийОстатки.Субконто1.Представление КАК КонтрагентП,
	                |	УправленческийОстатки.СуммаВалОстаток КАК СуммаВалОстаток,
	                |	УправленческийОстатки.Валюта КАК Валюта,
	                |	УправленческийОстатки.Валюта.Представление КАК ВалютаПредставление
	                |ИЗ
	                |	РегистрБухгалтерии.Управленческий.Остатки(
	                |			&ГраницаКонтроля,
	                |			Счет = &СчетПокупатели,
	                |			&Субконто,
	                |			Валюта = &Валюта
	                |				И Организация = &Организация
	                |				И Субконто1 В
	                |					(ВЫБРАТЬ
	                |						ТЧ.Контрагент КАК Контрагент
	                |					ИЗ
	                |						ТЧ КАК ТЧ)) КАК УправленческийОстатки
	                |ГДЕ
	                |	УправленческийОстатки.СуммаВалОстаток < 0"; 
	
	ГраницаКонтроля = Новый Граница(МоментВремени(),ВидГраницы.Включая);
	
	Субконто = Новый Массив;
	Субконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Контрагенты); 
	
	Запрос2.УстановитьПараметр("ГраницаКонтроля",ГраницаКонтроля);
	Запрос2.УстановитьПараметр("СчетПокупатели",ПланыСчетов.Управленческий.Покупатели);
	Запрос2.УстановитьПараметр("Валюта",Валюта);
	Запрос2.УстановитьПараметр("Субконто",Субконто);
	Запрос2.УстановитьПараметр("Организация",Организация);

	Результат = Запрос2.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат ОтменитьПроведение;
	КонецЕсли;
	
	ОтменитьПроведение = Истина;
    Выборка = Результат.Выбрать(); 
	
	Пока Выборка.Следующий() Цикл 
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Организация: %1,по Контрагенту: ""%2"" произошла переплата на сумму в валюте: %3 %4",Организация,Выборка.КонтрагентП,- Выборка.СуммаВалОстаток,Валюта);
		Сообщение.Сообщить();
	КонецЦикла;	
	
	Возврат ОтменитьПроведение;
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Переплата по контрагенту!";
	Сообщение.Сообщить();
	Возврат ОтменитьПроведение;
	
	Возврат ОтменитьПроведение;
	
КонецФункции
